#ifndef APP_PROJECT_CONFIG_H
#define APP_PROJECT_CONFIG_H
/*************************************************************************************************/
/*************************************************************************************************/
/*************************************************************************************************/
/* APP EXT 配置项 */
/*************************************************************************************************/
/*************************************************************************************************/
/*************************************************************************************************/
/* APP OS adaptor: */
#define APP_OS_IS_WINDOWS   1
#define APP_OS_IS_LINUX     0
#define APP_OS_IS_ZEPHYR    0
#define APP_OS_IS_FREERTOS  0
/* APP arch adaptor: */
#define APP_ARCH_IS_PC      1
/* APP dev config */
#define APP_DEV_LOG_MSG_USE     1
/*************************************************************************************************/
/*************************************************************************************************/
/*************************************************************************************************/
/* gui arch: */
#define APP_EXT_DEV_GUI_USE_WIN     1
#define APP_EXT_DEV_GUI_USE_SDL     0
/* gui framework: */
#define APP_EXT_DEV_GUI_IS_LVGL     0
#define APP_EXT_DEV_GUI_IS_SCUI     1
/*************************************************************************************************/
/*************************************************************************************************/
/*************************************************************************************************/
/* APP SYS 配置项 */
/*************************************************************************************************/
/*************************************************************************************************/
/*************************************************************************************************/
/* 全局日志宏控开关(所有:启用或禁用) */
#define APP_SYS_LOG_GLOBAL_STATUS       1   /* 1:ENABLE,0:DISABLE */
/* 全局日志宏控覆盖开关(作用:全局宏控覆盖本地宏控) */
#define APP_SYS_LOG_GLOBAL_OVERLAY      0   /* 1:ENABLE,0:DISABLE */
/* 全局日志宏控覆盖等级 */
#define APP_SYS_LOG_GLOBAL_LEVEL        2   /* 0:DEBUG,1:INFO,2:WARN,3:ERROR,4:NONE */
/* 全局日志宏控本地持久化开关(受限于日志宏开关) */
#define APP_SYS_LOG_RECORD_STATUS       1   /* 1:ENABLE,0:DISABLE */
/* 全局日志宏控本地持久化等级(受限于日志宏等级) */
#define APP_SYS_LOG_RECORD_LEVEL        3   /* 0:DEBUG,1:INFO,2:WARN,3:ERROR,4:NONE */
/* 日志文本存储单次限制(包括字符串结尾'\0') */
#define APP_SYS_LOG_TEXT_LIMIT          128
/* 全局断言检查开关 */
#define APP_SYS_ASSERT_STATUS           1   /* 1:ENABLE,0:DISABLE */
/* 全局函数追踪检查开关 */
#define APP_SYS_TRACE_STATUS            1   /* 1:ENABLE,0:DISABLE */
/*************************************************************************************************/
/*************************************************************************************************/
/*************************************************************************************************/
/* APP THREAD 配置项 */
/*************************************************************************************************/
/*************************************************************************************************/
/*************************************************************************************************/
/* 最长阻塞时间(秒) */
#define APP_MODULE_WATCHDOG_XS  5
/* 主线程调度模式
 * 线程组以事件组优先级进行实时调度或分时调度
 * 实时调度会保证优先级高的事件被立即激活
 * 分时调度以指定时间片内收集的事件进行调度
 * 分时调度会降低部分并发性但能节约部分调度性能
 */
#define APP_THREAD_MASTER_REALTIME      0
#define APP_THREAD_MASTER_TIME_SLICE    10
/* 线程事件包执行记录 */
#define APP_THREAD_PACKAGE_RECORD_CNT   50
/* 线程组线程包裹接收最大警告线(警告) */
#if     APP_THREAD_MASTER_REALTIME
#define APP_THREAD_PACKAGE_MASTER_MAX   20
#define APP_THREAD_PACKAGE_SLAVE_MAX    20
#else
#define APP_THREAD_PACKAGE_MASTER_MAX   100
#define APP_THREAD_PACKAGE_SLAVE_MAX    20
#endif
/* 子线程执行时间检查(ms) */
#define APP_THREAD_SLAVE_EXECUTE_TIME             1
/* 线程事件包执行时间检查(ms) */
#define APP_THREAD_SLAVE_EXECUTE_TIME_CHECK       0
#define APP_THREAD_SLAVE_EXECUTE_TIME_CHECK_MS    10
/*************************************************************************************************/
/*************************************************************************************************/
/*************************************************************************************************/
#endif
